tap "caskroom/cask"
tap "cloudfoundry/tap"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

cask "xquartz"
brew "autoconf"
brew "awscli"
brew "boost"
brew "gmp"
brew "mpfr"
brew "cgal"
brew "cloc"
brew "coreutils"
brew "cowsay"
brew "dnsmasq", restart_service: true
brew "figlet"
brew "findutils"
brew "foremost"
brew "fortune"
brew "liblwgeom"
brew "libxml2"
brew "readline"
brew "sqlite"
brew "libspatialite"
brew "gdal"
brew "little-cms2", args: ["universal"]
brew "ghostscript"
brew "git"
brew "libtasn1"
brew "nettle"
brew "gnutls"
brew "libusb", args: ["universal"]
brew "gnupg"
brew "gpp"
brew "libtool", args: ["universal"]
brew "graphviz"
brew "grep"
brew "heroku"
brew "hub"
brew "xz"
brew "imagemagick"
brew "jasper", args: ["universal"]
brew "jbig2dec"
brew "libusb-compat", args: ["universal"]
brew "libgphoto2", args: ["universal"]
brew "libicns", args: ["universal"]
brew "mackup"
brew "makedepend"
brew "mariadb", restart_service: true
brew "mongodb", restart_service: true
brew "pandoc", link: false
brew "pidof"
brew "pkg-config"
brew "postgresql", restart_service: true
brew "sfcgal"
brew "postgis"
brew "python"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "sane-backends"
brew "tree"
brew "watch"
brew "wine"
brew "yadm"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "cloudfoundry/tap/cf-cli"

cask "alfred"
cask "atom"
cask "firefox"
cask "google-chrome"
cask "graphiql"
cask "iterm2"
cask "macdown"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask 'visual-studio-code'
cask 'hyper'
cask 'synergy'
cask 'dashlane'
cask 'gpg-suite'
