tap 'caskroom/cask'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
cask 'xquartz'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# ruby
brew 'rbenv'
brew 'ruby-build'

# Apps
cask 'atom'
cask 'alfred'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'sublime-text'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'spotify'
cask 'macdown'
cask 'flux'


# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'exercism'
brew 'libpng', args: ['universal']
brew 'freetype', args: ['universal']
brew 'fontconfig', args: ['universal']
brew 'freexl'
brew 'jpeg', args: ['universal']
brew 'libtiff', args: ['universal']
brew 'gd', args: ['universal']
brew 'geos'
brew 'giflib'
brew 'json-c'
brew 'lzlib'
brew 'proj'
brew 'libgeotiff'
brew 'liblwgeom'
brew 'libxml2'
brew 'readline'
brew 'sqlite'
brew 'libspatialite'
brew 'gdal'
brew 'little-cms2', args: ['universal']
brew 'ghostscript'
brew 'libtasn1', args: ['universal']
brew 'nettle'
brew 'gnutls'
brew 'gpp'
brew 'libtool', args: ['universal']
brew 'graphviz'
brew 'hub'
brew 'xz'
brew 'imagemagick'
brew 'jasper', args: ['universal']
brew 'jbig2dec'
brew 'libusb', args: ['universal']
brew 'libusb-compat', args: ['universal']
brew 'libgphoto2', args: ['universal']
brew 'libicns', args: ['universal']
brew 'makedepend'
brew 'maven'
brew 'openssl', args: ['universal']
brew 'mongodb', restart_service: true
brew 'node'
brew 'pidof'
brew 'pkg-config'
brew 'postgresql', restart_service: true
brew 'sfcgal'
brew 'postgis'
brew 'qt5'
brew 'redis', restart_service: true
brew 'sane-backends', args: ['universal']
brew 'watch'
brew 'wine'
brew 'homebrew/boneyard/unfs3'


## other
brew 'autoconf'
brew 'boost'
brew 'gmp'
brew 'mpfr'
brew 'cgal'
brew 'cloc'
brew 'dnsmasq', restart_service: true
