tap "drone/drone"
tap "getantibody/tap"
tap "gobuffalo/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "molovo/revolver"
brew "autoconf"
brew "readline"
brew "sqlite"
brew "xz"
brew "python"
brew "awscli"
brew "bat"
brew "boost"
brew "gmp"
brew "mpfr"
brew "cgal"
brew "cloc"
brew "coreutils"
brew "cowsay"
brew "dnsmasq", restart_service: true
brew "exercism"
brew "figlet"
brew "findutils"
brew "foremost"
brew "fortune"
brew "libtool"
brew "freetds"
brew "jasper"
brew "libxml2"
brew "libspatialite"
brew "little-cms2"
brew "python@2"
brew "qt"
brew "gdal"
brew "ghostscript"
brew "git"
brew "libtasn1"
brew "nettle"
brew "gnutls"
brew "libusb"
brew "gnupg"
brew "go"
brew "gpp"
brew "graphviz"
brew "grep"
brew "heroku"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "jbig2dec"
brew "kubernetes-cli"
brew "libusb-compat"
brew "libgphoto2"
brew "libicns"
brew "liblwgeom"
brew "mackup"
brew "makedepend"
brew "pandoc"
brew "pgweb"
brew "pidof"
brew "pkg-config"
brew "postgresql", restart_service: true
brew "sfcgal"
brew "postgis"
brew "postgresql@10"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "sane-backends"
brew "telnet"
brew "thefuck"
brew "tree"
brew "watch"
brew "watchman"
brew "wine"
brew "yadm"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "drone/drone/drone"
brew "getantibody/tap/antibody"
brew "gobuffalo/tap/buffalo"
brew "goreleaser/tap/goreleaser"
brew "molovo/revolver/revolver"
cask "alfred"
cask "dashlane"
cask "firefox"
cask "gpg-suite"
cask "graphiql"
cask "hyper"
cask "iterm2"
cask "macdown"
cask "minikube"
cask "quicklook-json"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "synergy"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "xquartz"
